---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.CreateAggregateAttribute(System.String)
source: html/761e7923-0861-d882-63ac-6cb61e62ee2f.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.CreateAggregateAttribute Method

Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef

## Syntax (C#)
```csharp
public IFCAggregate CreateAggregateAttribute(
	string name
)
```

## Parameters
- **name** (`System.String`) - The attribute name.

## Returns
The aggregate.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null